'''Пришло время самостоятельно написать приветственный код!
На вход программе подаётся строка текста с именем человека.
Составь программу, которая выводит на экран «Привет» (без кавычек), 
после которого должны стоять запятая и пробел, а затем введённое имя.'''

print(f'Привет, {input()}')