'''Напишите программу, которая выводит такое «окно» на экран. Размер окна может
быть любым, вместо слова «друг» можете написать своё имя. '''
a = '================='
b = '||             ||'
print(a, b, b, sep='\n')
print('||   Привет,   ||')
print('||   Дмитрий!  ||')
print(b, b, a, sep='\n')