'''На вход программе подаётся строка текста — название футбольной команды. 
Напиши программу, которая повторяет название на экране со словом « — чемпион!»
(без кавычек). Например, при вводе «Спартак» на экран выведется 
«Спартак — чемпион!», а при вводе «Динамо» — «Динамо — чемпион!».'''

team_name = input()
print(f'{team_name} —  чемпион!')