'''Создайте переменную и запишите в неё математическое выражение.Затем выведите
значение переменной на экран. Ответ должен быть равен 378652.3611111111
(На самом деле 356807.1111111111).'''

variable = ((-3 + (8 ** 2 - 12)) / (2 * 18)) * (4 ** 3 ** 2)
print(variable)