# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def add_buns(number):
    print(f'Возьмём {number} булочки(у/ек)')
    
def add_patty(number):
    print(f'Положим {number} котлет(у/ы)')
    
def add_pickles(number):
    print(f'Добавим {number} огурчик(а/ов)')
    
def add_tomatos(number):
    print(f'А теперь {number} помидорчик(а/ов)')
    
def add_mayo(number):
    print(f'{number}-ую порцию майонеза')
    
def add_cheese(number):
    print(f'И {number} кусочк(а/oв) сыра')
    
def add_teriyaki(number):
    print(f'{number} ст. ложки терияки')

def add_honey(number):
    print(f'{number} ст. ложки мёда')

def add_pineapple(number):
    print(f'Кладём {number} колец ананаса')
    